Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/social_welfare/irish_social_welfare_system/social_insurance_prsi/index.html.txt.tmx
Source language: en
Languages: ga

source: Overview Document Social insurance Social insurance contributions entitle you to a range of benefits administered by the Department of Social Protection
ga: Overview Document An t-árachas sóisialach in Éirinn De thoradh ranníocaíochtaí árachais shóisialaigh bíonn tú i dteideal réimse leathan sochar atá riartha ag an Roinn Gnóthaí Sóisialacha agus Teaghlaigh

source: The social welfare benefits you can get are determined by the PRSI Class you are in
ga: Cinntíonn d'aicme ÁSPC na sochair leasa shóisialta a gheobhaidh tú

source: An overview of social insurance classes
ga: Cabhraíonn an doiciméad seo d'aicme árachais shóisialach agus an méid seachtainiúil iníoctha a fháil amach

source: Part-time work and social insurance (PRSI)
ga: Fostaíocht pháirtaimseartha agus árachas sóisialach

source: Explains how part-time work can affect your entitlement to social insurance payments
ga: Baineann fostaiocht phairtaimseartha le do theidlíocht Pinsean Stáit (Ranníocach)

source: Paying PRSI can entitle you to certain social welfare benefits
ga: Dualgas an fhostóra árachas sóisialta (ÁSPC) a íoc

source: This document explains your employer's duty to pay PRSI
ga: Dualgas an fhostóra árachas sóisialta (ÁSPC) a íoc

source: Employer Job (PRSI) Incentive Scheme
ga: Scéim Dreasachta Jabanna (ÁSPC) i gcomhair Fostóirí

source: This scheme exempted employers from their liability to pay their share of PRSI contributions for certain employees for 12 months
ga: Díolmhaíonn an scéim seo fostóirí óna ndliteanas a gcion de ranníocaíochtaí ÁSPC i leith fhostaithe áirithe a íoc ar feadh 12 mhí

source: This scheme makes it easier for a homemaker to qualify for the State Pension (Contributory)
ga: Is scéim í an Scéim Déantóra Bhaile a dhéanann éascaíocht do dhéantóir baile cáiliú don Phinsean Stáit (Ranníocach)

source: Benefit and contribution years for social welfare purposes
ga: Blianta sochair agus ranníocaíochta ar mhaithe le híocaíochtaí leasa shóisialaigh

source: To qualify for most social insurance payments, you must first have a certain number of PRSI contributions paid since you started work
ga: Chun cáiliú i gcomhair na coda is mó d'íocaíochtaí árachais shóisialta in Éirinn, caithfidh tú, ar an gcéad dul síos, oiread áirithe ranníocaíochtaí ÁSPC a bheith déanta acu ón am ar thosaigh tú ag obair

source: Find out which years count as benefit and contribution years for social welfare purposes
ga: Faigh amach cé acu bliain a bheith áirithe mar bhlianta sochair agus ranníocaíochta ar mhaithe le leas sóisialach

source: Credited social insurance contributions
ga: Ranníocaíochtaí creidiúnaithe árachais shóisialaigh

source: A credited social insurance contribution is a contribution given to you and recorded on your social insurance record
ga: Is é atá i ranníocaíocht chreidiúnaithe árachais shóisialaigh ná ranníocaíocht a thugann tú agus atá taifeadta ar do thaifead árachais shóisialaigh

source: What are the rules about credited contributions for students, carers, homemakers, voluntary development workers and those who take early retirement?
ga: Cad iad na rialacha faoi ranníocaíochtaí creidiúnaithe do mhic léinn, do chúramóirí, do dhéantóirí baile, d’oibrithe forbartha deonacha agus iad sin a ghlacann scor luath?

source: Voluntary social insurance contributions
ga: Ranníocaíochtaí deonacha árachais shóisialaigh

source: Voluntary social insurance contributions can help you qualify for a social insurance payment in the future
ga: Is féidir le ranníocaíochtaí deonacha árachais shóisialta cuidiú leat cáiliú i gcomhair íocaíochtaí árachais shóisialaigh sa todhchaí

source: Find out more about making voluntary contributions
ga: Faigh amach tuilleadh faoi ranníocaíochtaí deonacha a dhéanamh

source: Information on Class S PRSI contributions paid by self-employed people
ga: Faisnéis faoi ranníocaíochtaí ÁSPC Aicme S a íocann daoine féinfhostaithe

source: Most Read in "Social Welfare"
ga: Ábhar is mó éilimh i "Leas Sóisialach"

source: Back to School Clothing and Footwear Allowance
ga: Liúntas Éadaí agus Coisbhirt chun Filleadh ar Scoil
